{
  "__type__": "cc.TextAsset",
  "_name": "facebook.d",
  "_objFlags": 0,
  "_native": "",
  "text": "// Type definitions for non-npm package facebook-instant-games 6.3\n// Project: https://developers.facebook.com/docs/games/instant-games\n// Definitions by: Menushka Weeratunga <https://github.com/menushka>,\n//                 Øyvind Johansen Amundrud <https://github.com/oyvindjam>,\n//                 Liana Pigeot <https://github.com/nialna>\n// Definitions: https://github.com/DefinitelyTyped/DefinitelyTyped\n\n/**\n * Top level namespace for the Instant Games SDK.\n */\ndeclare namespace FBInstant {\n    /**\n     * Contains functions and properties related to the current player.\n     */\n    let player: Player;\n\n    /**\n     * Contains functions and properties related to the current game context.\n     */\n    let context: Context;\n\n    /**\n     * Contains functions and properties related to payments and purchases of game products.\n     */\n    let payments: Payments;\n\n    /**\n     * The current locale. Use this to determine what language the current game should be localized with.\n     * The value will not be accurate until FBInstant.startGameAsync() resolves.\n     *\n     * @returns The current locale.\n     */\n    function getLocale(): string | null;\n\n    /**\n     * The platform on which the game is currently running. The value will always be null until FBInstant.initializeAsync() resolves.\n     */\n    function getPlatform(): Platform | null;\n\n    /**\n     * The string representation of this SDK version.\n     *\n     * @returns The SDK version.\n     */\n    function getSDKVersion(): string;\n\n    /**\n     * Initializes the SDK library. This should be called before any other SDK functions.\n     *\n     * @returns A promise that resolves when the SDK is ready to use.\n     * @throws INVALID_OPERATION\n     */\n    function initializeAsync(): Promise<void>;\n\n    /**\n     * Report the game's initial loading progress.\n     *\n     * @param percentage A number between 0 and 100.\n     */\n    function setLoadingProgress(percentage: number): void;\n\n    /**\n     * Provides a list of API functions that are supported by the client.\n     *\n     * @returns List of API functions that the client explicitly supports.\n     */\n    function getSupportedAPIs(): string[];\n\n    /**\n     * Returns any data object associated with the entry point that the game was launched from.\n     *\n     * The contents of the object are developer-defined, and can occur from entry points on different platforms.\n     * This will return null for older mobile clients, as well as when there is no data associated with the particular entry point.\n     *\n     * @returns Data associated with the current entry point.\n     */\n    function getEntryPointData(): any;\n\n    /**\n     * Returns the entry point that the game was launched from.\n     * This function should be called after FBInstant.startGameAsync() resolves.\n     *\n     * @returns The name of the entry point from which the user started the game.\n     */\n    function getEntryPointAsync(): Promise<string>;\n\n    /**\n     * Sets the data associated with the individual gameplay session for the current context.\n     *\n     * This function should be called whenever the game would like to update the current session data.\n     * This session data may be used to populate a variety of payloads, such as game play webhooks.\n     *\n     * @param sessionData An arbitrary data object, which must be less than or equal to 1000 characters when stringified.\n     */\n    function setSessionData(sessionData: any): void;\n\n    /**\n     * This indicates that the game has finished initial loading and is ready to start.\n     * Context information will be up-to-date when the returned promise resolves.\n     *\n     * @returns A promise that resolves when the game should start.\n     * @throws INVALID_PARAM\n     * @throws CLIENT_UNSUPPORTED_OPERATION\n     */\n    function startGameAsync(): Promise<void>;\n\n    /**\n     * This invokes a dialog to let the user share specified content, either as a message in Messenger or as a post on the user's timeline.\n     * A blob of data can be attached to the share which every game session launched from the share will be able to access from FBInstant.getEntryPointData().\n     * This data must be less than or equal to 1000 characters when stringified. The user may choose to cancel the share action and close the dialog, and the\n     * returned promise will resolve when the dialog is closed regardless if the user actually shared the content or not.\n     *\n     * @param payload Specify what to share. See example for details.\n     * @returns A promise that resolves when the share is completed or cancelled.\n     * @throws INVALID_PARAM\n     * @throws NETWORK_FAILURE\n     * @throws PENDING_REQUEST\n     * @throws CLIENT_UNSUPPORTED_OPERATION\n     * @throws INVALID_OPERATION\n     */\n    function shareAsync(payload: SharePayload): Promise<void>;\n\n    /**\n     * Informs Facebook of an update that occurred in the game. This will temporarily yield control to Facebook and Facebook will decide what to do based on what the update is.\n     * The returned promise will resolve/reject when Facebook returns control to the game.\n     *\n     * @param payload A payload that describes the update.\n     * @returns A promise that resolves when Facebook gives control back to the game.\n     * @throws INVALID_PARAM\n     * @throws PENDING_REQUEST\n     * @throws INVALID_OPERATION\n     */\n    function updateAsync(payload: CustomUpdatePayload | LeaderboardUpdatePayload): Promise<void>;\n\n    /**\n     * Request that the client switch to a different Instant Game. The API will reject if the switch fails - else, the client will load the new game.\n     *\n     * @param appID The Application ID of the Instant Game to switch to. The application must be an Instant Game, and must belong to the same business as the current game.\n     * To associate different games with the same business, you can use Business Manager: https://developers.facebook.com/docs/apps/business-manager#update-business.\n     * @param data An optional data payload. This will be set as the entrypoint data for the game being switched to. Must be less than or equal to 1000 characters when stringified.\n     * @throws USER_INPUT\n     * @throws INVALID_PARAM\n     * @throws PENDING_REQUEST\n     * @throws CLIENT_REQUIRES_UPDATE\n     */\n    function switchGameAsync(appID: string, data?: any): Promise<void>;\n\n    /**\n     * Returns whether or not the user is eligible to have shortcut creation requested.\n     *\n     * Will return false if createShortcutAsync was already called this session or the user is ineligible for shortcut creation.\n     *\n     * @returns Promise that resolves with true if the game can request the player create a shortcut to the game, and false otherwise\n     * @throws PENDING_REQUEST\n     * @throws CLIENT_REQUIRES_UPDATE\n     * @throws INVALID_OPERATION\n     */\n    function canCreateShortcutAsync(): Promise<boolean>;\n\n    /**\n     * Prompts the user to create a shortcut to the game if they are eligible to Can only be called once per session. (see canCreateShortcutAsync)\n     * @throws USER_INPUT\n     * @throws PENDING_REQUEST\n     * @throws CLIENT_REQUIRES_UPDATE\n     * @throws INVALID_OPERATION\n     */\n    function createShortcutAsync(): Promise<void>;\n\n    /**\n     * Quits the game.\n     */\n    function quit(): void;\n\n    /**\n     * Log an app event with FB Analytics. See https://developers.facebook.com/docs/javascript/reference/v2.8#app_events for more details about FB Analytics.\n     *\n     * @param eventName Name of the event. Must be 2 to 40 characters, and can only contain '_', '-', ' ', and alphanumeric characters.\n     * @param valueToSum An optional numeric value that FB Analytics can calculate a sum with.\n     * @param parameters An optional object that can contain up to 25 key-value pairs to be logged with the event. Keys must be 2 to 40 characters,\n     * and can only contain '_', '-', ' ', and alphanumeric characters. Values must be less than 100 characters in length.\n     * @returns The error if the event failed to log; otherwise returns null.\n     */\n    function logEvent(eventName: string, valueToSum?: number, parameters?: { [key: string]: string; }): APIError | null;\n\n    /**\n     * Set a callback to be fired when a pause event is triggered.\n     * @param func A function to call when a pause event occurs.\n     */\n    function onPause(func: () => void): void;\n\n    /**\n     * Attempt to create an instance of interstitial ad. This instance can then be preloaded and presented.\n     * @param placementID The placement ID that's been setup in your Audience Network settings.\n     * @returns A promise that resolves with a AdInstance, or rejects with a APIError if it couldn't be created.\n     * @throws ADS_TOO_MANY_INSTANCES\n     * @throws CLIENT_UNSUPPORTED_OPERATION\n     */\n    function getInterstitialAdAsync(placementID: string): Promise<AdInstance>;\n\n    /**\n     * Attempt to create an instance of rewarded video. This instance can then be preloaded and presented.\n     * @param placementID The placement ID that's been setup in your Audience Network settings.\n     * @returns A promise that resolves with a AdInstance, or rejects with a APIError if it couldn't be created.\n     * @throws ADS_TOO_MANY_INSTANCES\n     * @throws CLIENT_UNSUPPORTED_OPERATION\n     */\n    function getRewardedVideoAsync(placementID: string): Promise<AdInstance>;\n\n    /**\n     * Attempts to match the current player with other users looking for people to play with. If successful, a new Messenger group\n     * thread will be created containing the matched players and the player will be context switched to that thread.\n     * The default minimum and maximum number of players in one matched thread are 2 and 20 respectively, depending on how many players\n     * are trying to get matched around the same time. The values can be changed in fbapp-config.json. See the\n     * [Bundle Config documentation]https://developers.facebook.com/docs/games/instant-games/bundle-config for documentation about fbapp-config.json.\n     *\n     * @param matchTag Optional extra information about the player used to group them with similar players. Players will only be grouped with other players with exactly the same tag.\n     * The tag must only include letters, numbers, and underscores and be 100 characters or less in length.\n     * @param switchContextWhenMatched Optional extra parameter that specifies whether the player should be immediately switched to the new context when a match is found.\n     * By default this will be false which will mean the player needs explicitly press play after being matched to switch to the new context.\n     * @param offlineMatch Optional extra parameter that specifies whether to start a match asynchronously. By default this will be false which means the game will start a match synchronously.\n     * @returns A promise that resolves when the player has been added to a group thread and switched into the thread's context.\n     * @throws INVALID_PARAM\n     * @throws NETWORK_FAILURE\n     * @throws USER_INPUT\n     * @throws PENDING_REQUEST\n     * @throws CLIENT_UNSUPPORTED_OPERATION\n     * @throws INVALID_OPERATION\n     */\n    function matchPlayerAsync(matchTag?: string, switchContextWhenMatched?: boolean, offlineMatch?: boolean): Promise<void>;\n\n    /**\n     * Checks if the current player is eligible for the matchPlayerAsync API.\n     * @returns  A promise that resolves with true if the player is eligible to match with other players and false otherwise.\n     * @throws NETWORK_FAILURE\n     * @throws CLIENT_UNSUPPORTED_OPERATION\n     */\n    function checkCanPlayerMatchAsync(): Promise<boolean>;\n\n    /**\n     * Fetch a specific leaderboard belonging to this Instant Game.\n     *\n     * @param name The name of the leaderboard. Each leaderboard for an Instant Game must have its own distinct name.\n     * @returns A promise that resolves with the matching leaderboard, rejecting if one is not found.\n     * @throws LEADERBOARD_NOT_FOUND\n     * @throws NETWORK_FAILURE\n     * @throws CLIENT_UNSUPPORTED_OPERATION\n     * @throws INVALID_OPERATION\n     * @throws INVALID_PARAM\n     */\n    function getLeaderboardAsync(name: string): Promise<Leaderboard>;\n\n    /**\n     * Posts the player's best score for the session to Facebook.\n     * This API should be called whenever the player achieves their best score in a session, preferably at the end of an activity\n     * Scores posted using this API should be consistent & comparable across game sessions.\n     *\n     * @param score An integer value representing the player's best score in a session.\n     * @returns void\n     */\n    function postSessionScore(score: number): void;\n\n    interface Player {\n        /**\n         * A unique identifier for the player. A Facebook user's player ID will remain constant,\n         * and is scoped to a specific game. This means that different games will have different\n         * player IDs for the same user. This function should not be called until FBInstant.initializeAsync()\n         * has resolved.\n         *\n         * @returns A unique identifier for the player.\n         */\n        getID(): string | null;\n\n        /**\n         * Fetch the player's unique identifier along with a signature that verifies that the identifier indeed\n         * comes from Facebook without being tampered with. This function should not be called until\n         * FBInstant.initializeAsync() has resolved.\n         *\n         * @param requestPayload  A developer-specified payload to include in the signed response.\n         * @returns A promise that resolves with a SignedPlayerInfo object.\n         * @throws INVALID_PARAM\n         * @throws NETWORK_FAILURE\n         * @throws CLIENT_UNSUPPORTED_OPERATION\n         */\n        getSignedPlayerInfoAsync(requestPayload?: string): Promise<SignedPlayerInfo>;\n\n        /**\n         * Returns a promise that resolves with whether the player can subscribe to the game bot or not.\n         * Developer can only call subscribeBotAsync() after checking canSubscribeBotAsync(), and the player will\n         * only be able to see this bot subscription dialog once for a specific game.\n         *\n         * @returns Whether a player can subscribe to the game bot or not.\n         */\n        canSubscribeBotAsync(): Promise<boolean>;\n\n        /**\n         * Request that the player subscribe the bot associated to the game. The API will reject if the subscription\n         * fails - else, the player will subscribe the game bot.\n         *\n         * @returns A promise that resolves if player successfully subscribed to the game bot, or rejects if request failed or player chose to not subscribe.\n         * @throws INVALID_PARAM\n         * @throws PENDING_REQUEST\n         * @throws CLIENT_REQUIRES_UPDATE\n         */\n        subscribeBotAsync(): Promise<void>;\n\n        /**\n         * The player's localized display name. This function should not be called until FBInstant.startGameAsync() has resolved.\n         *\n         * @returns The player's localized display name.\n         */\n        getName(): string | null;\n\n        /**\n         * A url to the player's public profile photo. The photo will always be a square, and with dimensions of at least 200x200.\n         * When rendering it in the game, the exact dimensions should never be assumed to be constant. It's recommended to always\n         * scale the image to a desired size before rendering. The value will always be null until FBInstant.startGameAsync() resolves.\n         *\n         * WARNING: Due to CORS, using these photos in the game canvas can cause it to be tainted, which will prevent the canvas data from being extracted.\n         * To prevent this, set the cross-origin attribute of the images you use to 'anonymous'.\n         *\n         * @returns Url to the player's public profile photo.\n         */\n        getPhoto(): string | null;\n\n        /**\n         * Retrieve data from the designated cloud storage of the current player.\n         *\n         * @param keys An array of unique keys to retrieve data for.\n         * @returns A promise that resolves with an object which contains the current key-value pairs for each key specified in the input array, if they exist.\n         * @throws INVALID_PARAM\n         * @throws NETWORK_FAILURE\n         * @throws CLIENT_UNSUPPORTED_OPERATION\n         */\n        getDataAsync(keys: string[]): Promise<DataObject>;\n\n        /**\n         * Set data to be saved to the designated cloud storage of the current player. The game can store up to 1MB of data for each unique player.\n         *\n         * @param data An object containing a set of key-value pairs that should be persisted to cloud storage. The object must contain only serializable\n         * values - any non-serializable values will cause the entire modification to be rejected.\n         * @returns A promise that resolves when the input values are set. NOTE: The promise resolving does not necessarily mean that the input has already been persisted.\n         * Rather, it means that the data was valid and has been scheduled to be saved. It also guarantees that all values that were set are now available in player.getDataAsync.\n         * @throws INVALID_PARAM\n         * @throws NETWORK_FAILURE\n         * @throws PENDING_REQUEST\n         * @throws CLIENT_UNSUPPORTED_OPERATION\n         */\n        setDataAsync(data: DataObject): Promise<void>;\n\n        /**\n         * Immediately flushes any changes to the player data to the designated cloud storage. This function is expensive, and should primarily be\n         * used for critical changes where persistence needs to be immediate and known by the game. Non-critical changes should rely on the platform\n         * to persist them in the background. NOTE: Calls to player.setDataAsync will be rejected while this function's result is pending.\n         *\n         * @returns  A promise that resolves when changes have been persisted successfully, and rejects if the save fails.\n         * @throws INVALID_PARAM\n         * @throws NETWORK_FAILURE\n         * @throws PENDING_REQUEST\n         * @throws CLIENT_UNSUPPORTED_OPERATION\n         */\n        flushDataAsync(): Promise<void>;\n\n        /**\n         * Retrieve stats from the designated cloud storage of the current player.\n         *\n         * @param keys An optional array of unique keys to retrieve stats for. If the function is called without it, it will fetch all stats.\n         * @returns A promise that resolves with an object which contains the current key-value pairs for each key specified in the input array, if they exist.\n         * @throws INVALID_PARAM\n         * @throws NETWORK_FAILURE\n         * @throws CLIENT_UNSUPPORTED_OPERATION\n         */\n        getStatsAsync(keys?: string[]): Promise<StatsObject>;\n\n        /**\n         * Set stats to be saved to the designated cloud storage of the current player.\n         *\n         * @param stats An object containing a set of key-value pairs that should be persisted to cloud storage as stats, which can be surfaced or used in a\n         * variety of ways to benefit player engagement.The object must contain only numerical values - any non-numerical values will cause the entire modification to be rejected.\n         * @returns A promise that resolves when the input values are set. NOTE: The promise resolving does not necessarily mean that the input has already been persisted.\n         * Rather, it means that the data was validated and has been scheduled to be saved. It also guarantees that all values that were set are now available in player.getStatsAsync.\n         * @throws INVALID_PARAM\n         * @throws NETWORK_FAILURE\n         * @throws PENDING_REQUEST\n         * @throws CLIENT_UNSUPPORTED_OPERATION\n         */\n        setStatsAsync(stats: StatsObject): Promise<void>;\n\n        /**\n         * Increment stats saved in the designated cloud storage of the current player.\n         *\n         * @param increments An object containing a set of key-value pairs indicating how much to increment each stat in cloud storage.\n         * The object must contain only numerical values - any non-numerical values will cause the entire modification to be rejected.\n         * @returns A promise that resolves with an object which contains the updated key-value pairs for each key specified in the input dictionary.\n         * NOTE: The promise resolving does not necessarily mean that the changes have already been persisted. Rather, it means that the increments were\n         * valid and have been scheduled to be performed. It also guarantees that all values that were incremented are now available in player.getStatsAsync.\n         * @throws INVALID_PARAM\n         * @throws NETWORK_FAILURE\n         * @throws PENDING_REQUEST\n         * @throws CLIENT_UNSUPPORTED_OPERATION\n         */\n        incrementStatsAsync(increments: IncrementObject): Promise<StatsObject>;\n\n        /**\n         * Fetches an array of ConnectedPlayer objects containing information about players that are connected to the current player.\n         * @returns A promise that resolves with a list of connected player objects. NOTE: This promise will not resolve until FBInstant.startGameAsync() has resolved.\n         * @throws NETWORK_FAILURE\n         * @throws CLIENT_UNSUPPORTED_OPERATION\n         */\n        getConnectedPlayersAsync(): Promise<ConnectedPlayer[]>;\n    }\n\n    interface Context {\n        /**\n         * A unique identifier for the current game context. This represents a specific context that the game is being played in\n         * (for example, a particular messenger conversation or facebook post). The identifier will be null if game is being played in\n         * a solo context. This function should not be called until FBInstant.startGameAsync has resolved.\n         *\n         * @returns A unique identifier for the current game context.\n         */\n        getID(): string | null;\n\n        /**\n         * The type of the current game context. POST - A facebook post. THREAD - A messenger thread.\n         * GROUP - A facebook group. SOLO - Default context, where the player is the only participant.\n         * This function should not be called until FBInstant.startGameAsync has resolved.\n         *\n         * @returns Type of the current game context\n         */\n        getType(): Type;\n\n        /**\n         * This function determines whether the number of participants in the current game context is between a given minimum and maximum, inclusive.\n         * If one of the bounds is null only the other bound will be checked against. It will always return the original result for the first call made in\n         * a context in a given game play session. Subsequent calls, regardless of arguments, will return the answer to the original query until a context\n         * change occurs and the query result is reset. This function should not be called until FBInstant.startGameAsync has resolved.\n         * This will be null if one or both of the supplied arguments are not valid, if we do not have a size available for the current context,\n         * or if the API is called before startGameAsync() resolves.\n         *\n         * @param minSize The minimum bound of the context size query.\n         * @param maxSize The maximum bound of the context size query.\n         * @returns ContextSizeResponse\n         */\n        isSizeBetween(minSize?: number, maxSize?: number): ContextSizeResponse | null;\n\n        /**\n         * Request a switch into a specific context. If the player does not have permission to enter that context,\n         * or if the player does not provide permission for the game to enter that context,\n         * this will reject. Otherwise, the promise will resolve when the game has switched into the specified context.\n         *\n         * @param id ID of the desired context.\n         * @returns A promise that resolves when the game has switched into the specified context, or rejects otherwise.\n         * @throws INVALID_PARAM\n         * @throws SAME_CONTEXT\n         * @throws NETWORK_FAILURE\n         * @throws USER_INPUT\n         * @throws PENDING_REQUEST\n         * @throws CLIENT_UNSUPPORTED_OPERATION\n         */\n        switchAsync(id: string): Promise<void>;\n\n        /**\n         * Opens a context selection dialog for the player. If the player selects an available context, the client will attempt to switch into that context,\n         * and resolve if successful. Otherwise, if the player exits the menu or the client fails to switch into the new context, this function will reject.\n         *\n         * @param options An object specifying conditions on the contexts that should be offered.\n         * @returns A promise that resolves when the game has switched into the context chosen by the user. Otherwise, the promise will reject (if the user cancels out of the dialog, for example).\n         * @throws INVALID_PARAM\n         * @throws SAME_CONTEXT\n         * @throws NETWORK_FAILURE\n         * @throws USER_INPUT\n         * @throws PENDING_REQUEST\n         * @throws CLIENT_UNSUPPORTED_OPERATION\n         */\n        chooseAsync(options?: ContextOptions): Promise<void>;\n\n        /**\n         * Attempts to create or switch into a context between a specified player and the current player. The returned promise will reject if the player listed is not a Connected Player of the current\n         * player or if the player does not provide permission to enter the new context. Otherwise, the promise will resolve when the game has switched into the new context.\n         *\n         * @param playerID ID of the player\n         * @returns A promise that resolves when the game has switched into the new context, or rejects otherwise.\n         * @throws INVALID_PARAM\n         * @throws SAME_CONTEXT\n         * @throws NETWORK_FAILURE\n         * @throws USER_INPUT\n         * @throws PENDING_REQUEST\n         * @throws CLIENT_UNSUPPORTED_OPERATION\n         */\n        createAsync(playerID: string): Promise<void>;\n\n        /**\n         * Gets an array of ContextPlayer objects containing information about active players — people who actively played the game in the current context in the last 90 days.\n         * This may include the current player.\n         * @throws NETWORK_FAILURE\n         * @throws CLIENT_UNSUPPORTED_OPERATION\n         * @throws INVALID_OPERATION\n         */\n        getPlayersAsync(): Promise<ContextPlayer[]>;\n    }\n\n    /**\n     * An Instant Game leaderboard\n     */\n    interface Leaderboard {\n        /**\n         * The name of the leaderboard.\n         */\n        getName(): string;\n\n        /**\n         * The ID of the context that the leaderboard is associated with, or null if the leaderboard is not tied to a particular context.\n         */\n        getContextID(): string | null;\n\n        /**\n         * Fetches the total number of player entries in the leaderboard.\n         *\n         * @returns  A unique identifier for the player.\n         * @throws NETWORK_FAILURE\n         * @throws RATE_LIMITED\n         */\n        getEntryCountAsync(): Promise<number>;\n\n        /**\n         * Updates the player's score. If the player has an existing score, the old score will only be replaced if the new score is better than it.\n         * NOTE: If the leaderboard is associated with a specific context, the game must be in that context to set a score for the player.\n         *\n         * @param score The new score for the player. Must be a 64-bit integer number.\n         * @param extraData Metadata to associate with the stored score. Must be less than 2KB in size.\n         * @returns Resolves with the current leaderboard entry for the player after the update.\n         * @throws LEADERBOARD_WRONG_CONTEXT\n         * @throws NETWORK_FAILURE\n         * @throws INVALID_PARAM\n         * @throws INVALID_OPERATION\n         * @throws RATE_LIMITED\n         */\n        setScoreAsync(score: number, extraData?: string): Promise<LeaderboardEntry>;\n\n        /**\n         * Retrieves the leaderboard's entry for the current player, or null if the player has not set one yet.\n         *\n         * @returns Resolves with the current leaderboard entry for the player.\n         * @throws NETWORK_FAILURE\n         * @throws INVALID_OPERATION\n         * @throws RATE_LIMITED\n         */\n        getPlayerEntryAsync(): Promise<LeaderboardEntry | null>;\n\n        /**\n         * Retrieves a set of leaderboard entries, ordered by score ranking in the leaderboard.\n         *\n         * @param count The number of entries to attempt to fetch from the leaderboard. Defaults to 10 if not specified. Up to a maximum of 100 entries may be fetched per query.\n         * @param offset The offset from the top of the leaderboard that entries will be fetched from.\n         * @returns Resolves with the leaderboard entries that match the query.\n         * @throws NETWORK_FAILURE\n         * @throws RATE_LIMITED\n         */\n        getEntriesAsync(count: number, offset: number): Promise<LeaderboardEntry[]>;\n\n        /**\n         * Retrieves the leaderboard score entries of the current player's connected players (including the current player), ordered by local rank within the set of connected players.\n         * @param count  The number of entries to attempt to fetch from the leaderboard. Defaults to 10 if not specified. Currently, up to a maximum of 100 entries may be fetched per query.\n         * @param offset The offset from the set of ordered connected player score entries to fetch from.\n         * @returns Resolves with the leaderboard entries that match the query.\n         */\n        getConnectedPlayerEntriesAsync(count: number, offset: number): Promise<LeaderboardEntry[]>;\n    }\n\n    /**\n     * A score entry for an Instant Game leaderboard\n     */\n    interface LeaderboardEntry {\n        /**\n         * Gets the score associated with the entry.\n         * @returns Returns an integer score value.\n         */\n        getScore(): number;\n\n        /**\n         * Gets the score associated with the entry, formatted with the score format associated with the leaderboard.\n         * @returns Returns a formatted score.\n         */\n        getFormattedScore(): string;\n\n        /**\n         * Gets the timestamp of when the leaderboard entry was last updated.\n         * @returns Returns a Unix timestamp.\n         */\n        getTimestamp(): number;\n\n        /**\n         * Gets the rank of the player's score in the leaderboard\n         * @returns Returns the entry's leaderboard ranking.\n         */\n        getRank(): number;\n\n        /**\n         * Gets the developer-specified payload associated with the score, or null if one was not set.\n         * @returns An optional developer-specified payload associated with the score.\n         */\n        getExtraData(): string | null;\n\n        /**\n         * Gets information about the player associated with the entry.\n         */\n        getPlayer(): LeaderboardPlayer;\n    }\n\n    /**\n     * Details about the player associated with a score entry.\n     */\n    interface LeaderboardPlayer {\n        /**\n         * Gets the player's localized display name.\n         *\n         * @returns The player's localized display name.\n         */\n        getName(): string;\n\n        /**\n         * Returns a url to the player's public profile photo.\n         *\n         * @returns Url to the player's public profile photo.\n         */\n        getPhoto(): string | null;\n\n        /**\n         * Gets the game's unique identifier for the player.\n         *\n         * @returns The game-scoped identifier for the player.\n         */\n        getID(): string | null;\n    }\n\n    /**\n     * Represents information about a player who is connected to the current player.\n     */\n    interface ConnectedPlayer {\n        /**\n         * Get the id of the connected player.\n         *\n         * @returns The ID of the connected player\n         */\n        getID(): string;\n\n        /**\n         * Get the player's full name.\n         *\n         * @returns The player's full name\n         */\n        getName(): string | null;\n\n        /**\n         * Get the player's public profile photo.\n         *\n         * @returns A url to the player's public profile photo\n         */\n        getPhoto(): string | null;\n    }\n\n    /**\n     * Represents information about the player along with a signature to verify that it indeed comes from Facebook.\n     */\n    interface SignedPlayerInfo {\n        /**\n         * Get the id of the player.\n         * @returns The ID of the player\n         */\n        getPlayerID(): string;\n\n        /**\n         * A signature to verify this object indeed comes from Facebook. The string is base64url encoded and signed with an HMAC version of your App Secret,\n         * based on the OAuth 2.0 spec.\n         *\n         * You can validate it with the following 4 steps:\n         *\n         * Split the signature into two parts delimited by the '.' character.\n         *\n         * Decode the first part (the encoded signature) with base64url encoding.\n         *\n         * Decode the second part (the response payload) with base64url encoding, which should be a string representation of a JSON object that has the following fields:\n         * ** algorithm - always equals to HMAC-SHA256\n         * ** issued_at - a unix timestamp of when this response was issued.\n         * ** player_id - unique identifier of the player.\n         * ** request_payload - the requestPayload string you specified when calling FBInstant.player.getSignedPlayerInfoAsync.\n         *\n         * Hash the whole response payload string using HMAC SHA-256 and your app secret and confirm that it is equal to the encoded signature.\n         *\n         * You may also wish to validate the issued_at timestamp in the response payload to ensure the request was made recently.\n         *\n         * Signature validation should only happen on your server. Never do it on the client side as it will compromise your app secret key.\n         *\n         * @returns The signature string.\n         */\n        getSignature(): string;\n    }\n\n    /**\n     * Represents information about a player who is in the context that the current player is playing in.\n     */\n    interface ContextPlayer {\n        /**\n         * Get the id of the context player.\n         *\n         * @returns The ID of the context player\n         */\n        getID(): string;\n\n        /**\n         * Get the player's localized display name.\n         *\n         * @returns The player's localized display name.\n         */\n        getName(): string | null;\n\n        /**\n         * Get the player's public profile photo.\n         *\n         * @returns A url to the player's public profile photo\n         */\n        getPhoto(): string | null;\n    }\n\n    /**\n     * Represents an instance of an ad.\n     */\n    interface AdInstance {\n        /**\n         * Return the Audience Network placement ID of this ad instance.\n         */\n        getPlacementID(): string;\n\n        /**\n         * Preload the ad. The returned promise resolves when the preload completes, and rejects if it failed.\n         * @throws ADS_FREQUENT_LOAD\n         * @throws ADS_NO_FILL\n         * @throws INVALID_PARAM\n         * @throws NETWORK_FAILURE\n         */\n        loadAsync(): Promise<void>;\n\n        /**\n         * Present the ad. The returned promise resolves when user finished watching the ad, and rejects if it failed to present or was closed during the ad.\n         * @throws ADS_NOT_LOADED\n         * @throws INVALID_PARAM\n         * @throws NETWORK_FAILURE\n         * @throws INVALID_OPERATION\n         */\n        showAsync(): Promise<void>;\n    }\n\n    interface Payments {\n        /**\n         * Fetches the game's product catalog.\n         *\n         * @returns The set of products that are registered to the game.\n         * @throws CLIENT_UNSUPPORTED_OPERATION\n         * @throws PAYMENTS_NOT_INITIALIZED\n         * @throws NETWORK_FAILURE\n         */\n        getCatalogAsync(): Promise<Product[]>;\n\n        /**\n         * Begins the purchase flow for a specific product. Will immediately reject if called before FBInstant.startGameAsync() has resolved.\n         *\n         * @param purchaseConfig The purchase's configuration details.\n         * @returns A Promise that resolves when the product is successfully purchased by the player. Otherwise, it rejects.\n         * @throws CLIENT_UNSUPPORTED_OPERATION\n         * @throws PAYMENTS_NOT_INITIALIZED\n         * @throws INVALID_PARAM\n         * @throws NETWORK_FAILURE\n         * @throws INVALID_OPERATION\n         */\n        purchaseAsync(purchaseConfig: PurchaseConfig): Promise<Purchase>;\n\n        /**\n         * Fetches all of the player's unconsumed purchases. As a best practice, the game should fetch the current player's purchases\n         * as soon as the client indicates that it is ready to perform payments-related operations. The game can then process and consume\n         * any purchases that are waiting to be consumed.\n         *\n         * @returns The set of purchases that the player has made for the game.\n         * @throws CLIENT_UNSUPPORTED_OPERATION\n         * @throws PAYMENTS_NOT_INITIALIZED\n         * @throws NETWORK_FAILURE\n         */\n        getPurchasesAsync(): Promise<Purchase[]>;\n\n        /**\n         * Consumes a specific purchase belonging to the current player. Before provisioning a product's effects to the player,\n         * the game should request the consumption of the purchased product. Once the purchase is successfully consumed, the game\n         * should immediately provide the player with the effects of their purchase.\n         *\n         * @param purchaseToken The purchase token of the purchase that should be consumed.\n         * @throws CLIENT_UNSUPPORTED_OPERATION\n         * @throws PAYMENTS_NOT_INITIALIZED\n         * @throws INVALID_PARAM\n         * @throws NETWORK_FAILURE\n         */\n        consumePurchaseAsync(purchaseToken: string): Promise<void>;\n\n        /**\n         * Sets a callback to be triggered when Payments operations are available.\n         * @param callback The callback function to be executed when Payments are available.\n         */\n        onReady(callback: () => void): void;\n    }\n\n    /**\n     * Represents a game's product information.\n     */\n    interface Product {\n        /**\n         * The title of the product\n         */\n        title: string;\n\n        /**\n         * The product's game-specified identifier\n         */\n        productID: string;\n\n        /**\n         * The product description\n         */\n        description?: string | undefined;\n\n        /**\n         * A link to the product's associated image\n         */\n        imageURI?: string | undefined;\n\n        /**\n         * The price of the product\n         */\n        price: string;\n\n        /**\n         * The currency code for the product\n         */\n        priceCurrencyCode: string;\n    }\n\n    /**\n     * The answer field is true if the current context size is between the minSize and maxSize values that are specified in the object, and false otherwise.\n     */\n    interface ContextSizeResponse {\n        answer: boolean;\n        minSize?: number | undefined;\n        maxSize?: number | undefined;\n    }\n\n    /**\n     * Represents an individual purchase of a game product.\n     */\n    interface Purchase {\n        /**\n         * A developer-specified string, provided during the purchase of the product\n         */\n        developerPayload?: string | undefined;\n\n        /**\n         * The identifier for the purchase transaction\n         */\n        paymentID: string;\n\n        /**\n         *  The product's game-specified identifier\n         */\n        productID: string;\n\n        /**\n         * Unix timestamp of when the purchase occurred\n         */\n        purchaseTime: string;\n\n        /**\n         *  A token representing the purchase that may be used to consume the purchase\n         */\n        purchaseToken: string;\n\n        /**\n         *  Server-signed encoding of the purchase request\n         */\n        signedRequest: SignedPurchaseRequest;\n    }\n\n    interface ContextOptions {\n        /**\n         * The set of filters to apply to the context suggestions.\n         */\n        filters?: ContextFilter[] | undefined;\n\n        /**\n         * The maximum number of participants that a suggested context should ideally have.\n         */\n        maxSize?: number | undefined;\n\n        /**\n         * The minimum number of participants that a suggested context should ideally have.\n         */\n        minSize?: number | undefined;\n    }\n\n    /**\n     * Represents content to be shared by the user.\n     */\n    interface SharePayload {\n        /**\n         * Indicates the intent of the share.\n         */\n        intent: Intent;\n\n        /**\n         * A base64 encoded image to be shared.\n         */\n        image: string;\n\n        /**\n         * A text message to be shared.\n         */\n        text: string;\n\n        /**\n         * A blob of data to attach to the share. All game sessions launched from the share will be able to access this blob through FBInstant.getEntryPointData().\n         */\n        data?: any;\n    }\n\n    /**\n     * An API Error returned by the Instant Games SDK\n     */\n    interface APIError {\n        /**\n         * The relevant error code\n         */\n        code: ErrorCodeType;\n        /**\n         * A message describing the error\n         */\n        message: string;\n    }\n\n    /**\n     * The configuration of a purchase request for a product registered to the game.\n     */\n    interface PurchaseConfig {\n        /**\n         * The identifier of the product to purchase\n         */\n        productID: string;\n\n        /**\n         * An optional developer-specified payload, to be included in the returned purchase's signed request.\n         */\n        developerPayload?: string | undefined;\n    }\n\n    /**\n     * Represents a custom update for FBInstant.updateAsync.\n     */\n    interface CustomUpdatePayload {\n        /**\n         * For custom updates, this should be 'CUSTOM'.\n         */\n        action: UpdateAction;\n\n        /**\n         * ID of the template this custom update is using. Templates should be predefined in fbapp-config.json.\n         * See the [Bundle Config documentation]https://developers.facebook.com/docs/games/instant-games/bundle-config\n         * or documentation about fbapp-config.json.\n         */\n        template: string;\n\n        /**\n         * Optional call-to-action button text. By default we will use a localized 'Play' as the button text. To provide localized\n         * versions of your own call to action, pass an object with the default cta as the value of 'default' and another object mapping\n         * locale keys to translations as the value of 'localizations'.\n         */\n        cta?: (string | LocalizableContent) | undefined;\n\n        /**\n         * Data URL of a base64 encoded image.\n         */\n        image: string;\n\n        /**\n         * A text message, or an object with the default text as the value of 'default' and another object mapping locale keys to\n         * translations as the value of 'localizations'.\n         */\n        text: (string | LocalizableContent);\n\n        /**\n         * A blob of data to attach to the update. All game sessions launched from the update will be able to access this blob\n         * through FBInstant.getEntryPointData(). Must be less than or equal to 1000 characters when stringified.\n         */\n        data?: any;\n\n        /**\n         * Specifies how the update should be delivered. This can be one of the following:\n         *\n         * 'IMMEDIATE' - The update should be posted immediately.\n         *\n         * 'LAST' - The update should be posted when the game session ends. The most recent update sent using the 'LAST' strategy will be the one sent.\n         *\n         * 'IMMEDIATE_CLEAR' - The update is posted immediately, and clears any other pending updates (such as those sent with the 'LAST' strategy).\n         *\n         * If no strategy is specified, we default to 'IMMEDIATE'.\n         */\n        strategy?: string | undefined;\n\n        /**\n         * Specifies notification setting for the custom update. This can be 'NO_PUSH' or 'PUSH', and defaults to 'NO_PUSH'.\n         * Use push notification only for updates that are high-signal and immediately actionable for the recipients.\n         * Also note that push notification is not always guaranteed, depending on user setting and platform policies.\n         */\n        notification?: string | undefined;\n    }\n\n    /**\n     * Represents a leaderboard update for FBInstant.updateAsync.\n     */\n    interface LeaderboardUpdatePayload {\n        /**\n         * For a leaderboard update, this should be 'LEADERBOARD'. text. By default we will use a localized 'Play Now' as the button text.\n         */\n        action: UpdateAction;\n\n        /**\n         * The name of the leaderboard to feature in the update.\n         */\n        name: string;\n\n        /**\n         * Optional text message. If not specified, a localized fallback message will be provided instead.\n         */\n        text?: string | undefined;\n    }\n\n    /**\n     * Represents a string with localizations and a default value to fall back on.\n     */\n    interface LocalizableContent {\n        /**\n         * The default value of the string to use if the viewer's locale is not a key in the localizations object.\n         */\n        default: string;\n        /**\n         *  Specifies what string to use for viewers in each locale. See https://origincache.facebook.com/developers/resources/?id=FacebookLocales.xml for a complete list of supported locale values.\n         */\n        localizations: LocalizationsDict;\n    }\n\n    interface DataObject { [ key: string ]: any; }\n\n    interface StatsObject { [ key: string ]: number; }\n\n    interface IncrementObject { [ key: string ]: number; }\n\n    /**\n     * Represents a mapping from locales to translations of a given string. Each property is an optional five-character Facebook locale code of the form xx_XX.\n     * See https://origincache.facebook.com/developers/resources/?id=FacebookLocales.xml for a complete list of supported locale codes.\n     */\n    interface LocalizationsDict {\n        [x: string]: string;\n    }\n\n    type SignedPurchaseRequest = string;\n\n    /**\n     * A filter that may be applied to a Context Choose operation\n     * 'NEW_CONTEXT_ONLY' - Prefer to only surface contexts the game has not been played in before.\n     * 'INCLUDE_EXISTING_CHALLENGES' - Include the \"Existing Challenges\" section, which surfaces actively played-in contexts that the player is a part of.\n     * 'NEW_PLAYERS_ONLY' - In sections containing individuals, prefer people who have not played the game.\n     */\n    type ContextFilter = \"NEW_CONTEXT_ONLY\" | \"INCLUDE_EXISTING_CHALLENGES\" | \"NEW_PLAYERS_ONLY\";\n\n    /**\n     * Represents the type of the update action to perform.\n     *\n     * \"CUSTOM\": A custom update, with all content specified by the game.\n     * \"LEADERBOARD\": An update associated with an Instant Game leaderboard.\n     */\n    type UpdateAction = \"CUSTOM\" | \"LEADERBOARD\";\n\n    /**\n     * Represents the current platform that the user is playing on.\n     */\n    type Platform = \"IOS\" | \"ANDROID\" | \"WEB\" | \"MOBILE_WEB\";\n\n    type Type = \"POST\" | \"THREAD\" | \"GROUP\" | \"SOLO\";\n\n    type Intent = \"INVITE\" | \"REQUEST\" | \"CHALLENGE\" | \"SHARE\";\n\n    type ErrorCodeType = \"ADS_FREQUENT_LOAD\" |\n        \"ADS_NO_FILL\" |\n        \"ADS_NOT_LOADED\" |\n        \"ADS_TOO_MANY_INSTANCES\" |\n        \"ANALYTICS_POST_EXCEPTION\" |\n        \"CLIENT_REQUIRES_UPDATE\" |\n        \"CLIENT_UNSUPPORTED_OPERATION\" |\n        \"INVALID_OPERATION\" |\n        \"INVALID_PARAM\" |\n        \"LEADERBOARD_NOT_FOUND\" |\n        \"LEADERBOARD_WRONG_CONTEXT\" |\n        \"NETWORK_FAILURE\" |\n        \"PENDING_REQUEST\" |\n        \"RATE_LIMITED\" |\n        \"SAME_CONTEXT\" |\n        \"UNKNOWN\" |\n        \"USER_INPUT\";\n}"
}